{"pageProps":{"postData":{"frontmatter":{"title":"Geometric Progression and the Compounding of the Returns","description":"Your savings account offers a 1% annual interest! The account balance in 10 years? +10%? Naaaah","date":"December 6, 2020","topic":{"id":"mathematics","name":"Mathematics","image":"mathematics.png","description":"Investing, as part of the Science of Finance, is subject to the lows of Mathematics!","color":"bg-green-300"},"author":{"id":"chris","name":"Chris","image":"https://s.gravatar.com/avatar/db809ecfa64d56da4bd9704c8393005a?s=80","description":"Software Engineer, passionate about ..."},"img":"/static/fractal-star.png","tags":[]},"post":{"content":"\n## Compounding of Returns\n\nLet us consider the following scenario. A stock asset yields an average monthly return R of 2% for the last 12 months. If we had invested 100$ on this asset a year ago, what would be the outcome of this investment today?\n\nConsider the initial asset price $P_0 = 100$. After the first month of the investment the outcome would be:\n\n$$\nP_1 = 100 + (100 * 0.02) = (100 * 1) + (100 * 0.02) = 100 * (1 + 0.02) = P_0 * 1.02\n$$\n\nThe outcome after the 2nd month would be:\n\n$$\nP_2 = P_1 + (P_1 * 0.02) = P_1 * 1.02\n$$\n\n3rd month:\n\n$$\nP_3 = P_2 + (P_2 * 0.02) = P_2 * 1.02\n$$\n\n(ν-1)th month:\n\n$$\nP_{ν-1} = P_{ν-2} + (P_{ν-2} * 0.02) = P_{ν-2} * 1.02\n$$\n\nνth month:\n\n$$\nP_ν = P_{ν-1} + (P_{ν-1} * 0.02) = P_{ν-1} * 1.02\n$$\n\nIt becomes obvious from the above that generating each element in the sequence $P_0, P_1, ..., P_{ν-1}, P_ν$ follows a pattern where the present number is generated by multiplying the previous number with a constant.\n\nIn our case, the constant is the average monthly return + 1. If we combine the previous equations in an attempt to formulate a final equation that provides the νth based on the $P_0$ element then:\n\n$$\nP_ν = P_{ν-1} * 1.02 = (P_{ν-2} * 1.02) * 1.02 = P_{ν-2} * 1.02^2 = .... = P_0 * (1 + 0.02)^ν\n$$\n\nSo, after 12 months we will have $100 * 1.02^12 = 126.82$!\n\nThe generic equation is:\n\n$$\nP_ν = P_0 * (1 + R_ν)^ν \\qquad (1)\n$$\n\n## Geometric Progression\n\nIn calculus, a sequence of numbers where each term after the first is found by multiplying the previous one by a fixed, non-one number, called `geometric progression`. The fixed number is called, the `common ratio`.\n\nSome interesting properties to notice:\n\n* a common ratio greater than 1, will produce exponential growth towards positive infinity!\n* a common ratio greater than 0 and up to 1, will produce exponential decay towards zero!\n\nIn the example above the way we used the return to calculate the end result is called **Compounding of Returns**.\n\n## From annual to periodic returns\n\nLet's see the example above from another angle. Let's say that an assets had a total return over the last year of 10%. What was the average monthly return of the asset?\n\nWe calculate a simple/arithmetic return (pandas.pct_change) like:\n\n$$\nR_i = \\frac{P_i-P_{i-1}}{P_{i-1}} = \\frac{P_i}{P_{i-1}} - 1 \\qquad (2)\n$$\n\nwhere $P_i$ is the price of the asset on the period $i$.\n\nBy assuming (for simplicity) that $P_0 = 1$ and from (2), $P_1 = P_0 * (1 + R_{annual})$\n\nThen from (1),\n\n$$\n1 + R_{annual} = 1 * (1 + R_{month})^12 => R_{month} = \\sqrt[12]{1+R_{annual}} - 1 (3)\n$$\n\nWe use ν = 12, because 1 year = 12 months (=> 12 compounding periods). If instead of monthly returns we were asked to find quarter returns then we would use ν = 4 ($R_{quarter} = \\sqrt[4]{1+R_{annual}} - 1$).\n\nFinally, from (3),\n\n$$\nR_{monthly} = \\sqrt[12]{1 + 0.1} - 1 = \\sqrt[12]{1.1} - 1 = 1.0079 - 1 = 0.0079\n$$\n\n## Compounding variable returns\n\nIt is commonly accepted that returns do not stay the same over periods. For example, the average return of this month is not the same as the one from last month! However, the same principle of compounding applies in this case too. Let's see an example.\n\nAn asset yields the following return for the past couple of months $0.021, 0.032, -0.018, 0.06, -0.043, 0.048$. The total return is the **product** of the individual returns when 1 is added to them:\n\n$$\nR = (1 + 0.021) * (1 + 0.032) * (1 - 0.018) * (1 + 0.06) * (1 - 0.043) * (1 + 0.048) = ...\n$$\n\nThis, resonates with the equation (1) above where for a fixed return we have $R_{total} = (1 + R_{fixed})^{number-of-periods}$","excerpt":""},"previousPost":{"slug":"measures-of-variability","frontmatter":{"title":"Measures of Variability","description":"Standard deviation & percentiles! Used for measuring volatility, and allow for a rough \"estimate\" of the near future.","date":"November 1, 2020","topic":{"id":"mathematics","name":"Mathematics","image":"mathematics.png","description":"Investing, as part of the Science of Finance, is subject to the lows of Mathematics!","color":"bg-green-300"},"author":{"id":"chris","name":"Chris","image":"https://s.gravatar.com/avatar/db809ecfa64d56da4bd9704c8393005a?s=80","description":"Software Engineer, passionate about ..."},"img":"/static/standard-deviation.png","tags":[]},"excerpt":"","content":"\n[Measures of location](/post/measures-of-location) cannot identify how well average, mode, etc. represent the data. They fail to answer questions like:\n\n* How close are the values to each other?\n* What is the largest difference between the values?\n* On average, how far are the values from each other?\n\nMeasures of variability (also called spread) fill this gap. The most common are:\n\n* Standard Deviation (SD)\n* Range, which is the largest value minus the smallest value\n* Interquartile Range (IQR) which is the upper quartile (75th percentile), minus the lower quartile (25th percentile)\n\nIn investing, Standard Deviation is one of the most common methods for determining the risk of an investment (also called `volatility`).\n\n## Variance ($Var$ or $\\sigma^2$) & Standard Deviation ($\\sigma$)\n\nVariance is the average squared difference from the mean, or alternatively, how spread out the data are around their mean.  \n\n$$\nVar(x) = \\sigma^2 = \\sigma_x^2 = \\frac{\\sum_{i=1}^{n}(x_i - \\bar{x})^2}{n-1}\n$$\n\n> **Note**: We can divide by n or n-1. n is the total population of an event. n-1 a series of it. numpy is, by default, using n-1! The difference is negligible for long sequences, but not for short ones!\n\nWe see above that, for some reason, we squared the difference ($(x_i - \\bar{x})^2$), instead of just taking the absolute difference ($x_i - \\bar{x}$). We did that in order to avoid the [same problem](/post/measures-of-location) we have with the mean, where the sum can be zero because of negative values in the list. Imagine, for example, having the sequence `-10,1,2,3,4`. What is the mean value? 0! And, how spread are the data around the mean? 0 again. It doesn't really make any sense, right? By observing the sequence, we see that there is some spreading of the data around \"something\". This, \"something\" doesn't feel to be 0. It feels like something close to the `1,2,3,4` values, which look like a group of values that are really close to each other. I know that is difficult to grasp it. But not until we raise it to another \"dimension\" :). And that is what we do when we square the values.\n\n* we remove the negative sign\n* we make the values that are far from \"the group\", to stand out (the outliers are emphasized).\n* we change the unit of measurement (it is now something much bigger). Like another dimension!\n\nTo return back to the unit we started with, but meanwhile keep the notion of spreading, we use the RMS ([Root Mean Square](/post/measures-of-location)) of all the distances to the mean. We call that Standard Deviation (SD): \n\n$$\n\\sigma_x = \\sqrt{Var(x)}\n$$\n\n\n### Standard Deviation in Investing\n\nStandard Deviation measures the volatility of an asset. Large values mean that the asset's price can diverge a lot from the mean value. Thus, an indication of higher risk. On the flip side, low volatility may indicate low risk. \n\n> A critical point to remember is that standard Deviation is a backward looking tool and not a guarantee of future moves.\n\nWhile daily returns (usually log returns) of an asset are more like leptokurtotic distributions (i.e. exhibit fat tails), we can add some abstraction by saying that are normally distributed (not to measure actual risk, but to get an initial approximation of risk). \n\nNormal distributions have some very unique attributes. The most important are:\n\n* The center of a normal distribution is located at its peak, and 50% of the data lies above the mean, while 50% lies below. The mean, median, and mode are all equal\n* Approximately 68% of the data lies within 1 SD of the mean, Approximately 95% of the data lies within 2 SD of the mean, Approximately 99.7% of the data lies within 3 SD of the mean. This is known as `The empirical rule`.\n\n![png](measures-of-variability-normal-distribution.png)\n\nLet's assume that the average price of an asset $40 (measured with daily returns for some period) and the standard deviation is $5. We can assume with 95% certainty the next closing price remains between $30 and $50! (More on that in a later post). In other words, we are 95% sure that the max loss will not exceed $10.\n\n\n## Percentiles\n\nWe find the percentile by ordering all the values in a dataset from smallest to largest. Then we multiply the number of values by the percentile we want. This, will give us the index of this percentile in the dataset. The value at this index is the requested percentile.\n\nFor example, suppose you have 12 daily stock return, ordered from lowest to highest: `2.3, 2.7, 3.1, 3.5, 3.9, 4.6, 4.7, 5, 5.1, 5.2, 5.4, 9`. To find the 90th percentile for these (ordered) returns, start by multiplying 90% times the size of the dataset, which gives 90% * 12 = 0.90 * 12 = 10.8 (the index). Rounding up to the nearest whole number, you get 11.\n\nCounting from left to right (from the smallest to the largest value in the dataset), you go until you find the 11th value in the dataset. That value is 5.4, and it’s the 90th percentile for this dataset.\n\nSomeone can think of the percentile as a lower dimension of the quantile. And the quartile a lower dimension of the percentile. This, because a quantile (which spans to any type of quantity) can take any upper value (like ex. 1500). The percentile (cent=100) is bound between 0-100. And the quartile (quarter) bound between 1-4. \n\nThus:\n\n* The 25th percentile is also called the first quartile.\n* The 50th percentile is generally the median.\n* The 75th percentile is also called the third quartile.\n* The difference between the third and first quartiles is the interquartile range.\n\n### Percentiles in Investing\n\nA simple example of how percentiles can be used in Investing was introduced in the previous section, where we asked, how sure we were that a loss will not exceed a value. Questions like that can be asked in numerous ways, and in the majority of the cases involve some sort of percentile representation."},"nextPost":{"slug":"load-google-drive-folder-in-google-colab","frontmatter":{"title":"Load Google Drive folder in Google Colab","description":"How to mount a Google Drive in Google Colab and load some stock data.","date":"December 7, 2020","topic":{"id":"automation","name":"Automation","image":"automation.jpg","description":"Spending time to do the same thing over and over again is tedious! Thus, I like to automate as much as possible.","color":"bg-green-300"},"tags":[{"id":"python","name":"python","image":"python-header.png","description":"Python is very handy in investing","color":"bg-green-300","icon":"python.svg"}],"author":{"id":"chris","name":"Chris","image":"https://s.gravatar.com/avatar/db809ecfa64d56da4bd9704c8393005a?s=80","description":"Software Engineer, passionate about ..."},"img":"/static/google-colab.png"},"excerpt":"","content":"\nThere are several cases where:\n\n* fetching stock prices is not possible through python libraries like `yahoofinancials` or other APIs\n* you want to load the same data over and over again (for parallelization)\n* you want to use you python modules without publishing them to a registry\n\nIn these cases I find it very handy to store my data (csv format) and my modules in google drive.\n\nHowever, loading the data to Google Colab turned into pain since I had to manually upload the files each time I wanted to run a notebook.\n\nTo avoid this situation I mount google drive and:\n\n1. add the folder with my python modules to the path\n2. copy the data to the Colab data folder\n\n```python\nimport warnings\nwarnings.simplefilter('ignore')\n\n%config InlineBackend.figure_formats=[\"png\"]\n\nfrom google.colab import drive\ndrive.mount('/content/drive', force_remount=True)\n\nimport os\nimport sys\nimport glob\nfrom shutil import copytree, copy\n\n# This will add my python modules in the path\ngdrive_base_path = '/content/drive/My Drive/my-python-modules'\nsys.path.append(gdrive_base_path)\n\ntry:\n  # copy the data we need\n  copytree('/content/drive/My Drive/Colab Notebooks/data', '/content/data')\nexcept Exception as e:\n  pass\n\n%reload_ext autoreload\n%autoreload 2\n%matplotlib inline\n\nimport matplotlib.pyplot as plt\nimport seaborn\nimport pandas as pd\nimport numpy as np\nimport scipy.stats as st\n```\n\nSince the folder that contain my python modules is now in the system path, I'm able to\n\n```python\nimport my_module\n```\n\nand whenever I change my modules (add more functionality, improvements), it practically saves it to Google Drive, since it is a pure mount.\n\nWhen it comes to loading data, then I simply:\n\n```python\nMSFT = pd.read_csv('data/msft_daily.csv', parse_dates=True, index_col=0, header=0)\n```\n\n> **Note**: Since `copytree` is used, uploading new data files to Google Colab, will not automatically save it to Google Drive!\n"}},"tags":[{"id":"python","name":"python","image":"python-header.png","description":"Python is very handy in investing","color":"bg-green-300","icon":"python.svg","slug":"python","count":2}],"sortedTopics":[{"id":"mathematics","name":"Mathematics","image":"mathematics.png","description":"Investing, as part of the Science of Finance, is subject to the lows of Mathematics!","color":"bg-green-300","slug":"mathematics","count":3},{"id":"automation","name":"Automation","image":"automation.jpg","description":"Spending time to do the same thing over and over again is tedious! Thus, I like to automate as much as possible.","color":"bg-green-300","slug":"automation","count":1}],"allTopics":[{"id":"mathematics","name":"Mathematics","image":"mathematics.png","description":"Investing, as part of the Science of Finance, is subject to the lows of Mathematics!","color":"bg-green-300"},{"id":"automation","name":"Automation","image":"automation.jpg","description":"Spending time to do the same thing over and over again is tedious! Thus, I like to automate as much as possible.","color":"bg-green-300"}],"slug":"geometric-progression-and-compounding-of-returns"},"__N_SSG":true}